In [1]:
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [4]:
data('HairEyeColor')

     Hair    Eye     Sex  Freq
1   Black  Brown    Male    32
2   Brown  Brown    Male    53
3     Red  Brown    Male    10
4   Blond  Brown    Male     3
5   Black   Blue    Male    11
6   Brown   Blue    Male    50
7     Red   Blue    Male    10
8   Blond   Blue    Male    30
9   Black  Hazel    Male    10
10  Brown  Hazel    Male    25
11    Red  Hazel    Male     7
12  Blond  Hazel    Male     5
13  Black  Green    Male     3
14  Brown  Green    Male    15
15    Red  Green    Male     7
16  Blond  Green    Male     8
17  Black  Brown  Female    36
18  Brown  Brown  Female    66
19    Red  Brown  Female    16
20  Blond  Brown  Female     4
21  Black   Blue  Female     9
22  Brown   Blue  Female    34
23    Red   Blue  Female     7
24  Blond   Blue  Female    64
25  Black  Hazel  Female     5
26  Brown  Hazel  Female    29
27    Red  Hazel  Female     7
28  Blond  Hazel  Female     5
29  Black  Green  Female     2
30  Brown  Green  Female    14
31    Red  Green  Female     7
32  Blond  Green  Female     8

In [5]:
np.random.seed(123)

In [9]:
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [10]:
df

       name  math  english  reading classroom
0     Sally    63       90       80         B
1      Jane    65       66       72         B
2     Suzie    60       86       78         A
3     Billy    71       76       77         B
4       Ada    94       66       61         B
5      John    70       74       87         B
6    Thomas    82       99       82         B
7     Marie    73       71       63         A
8    Albert    78       67       63         A
9   Richard    96       61       71         A
10    Isaac    75       97       81         B
11     Alan    87       85       85         B

We can make dataframes out of dictionaries of lists (or np arrays) and lists of lists

In [11]:
quotes = pd.read_json('https://aphorisms.glitch.me/api/all')

In [17]:
quotes.sample(5)

,quote,author,name
126,There are only two kinds of bugs: typographical errors and opportunities to learn some...,Wynter Snow,NaN
24,"Whatever you are, be a good one.",NaN,Abraham Lincoln
98,"I think that making things easy is sort-of like a way to ""invent"" a new feature for pe...",Julia Evans,NaN
162,Good design is writing without words.,Fred Lambuth,NaN
147,The first rule of Assessment: Results need to be interpreted. Numbers without context ...,Iris Gonzalez,NaN